# SetWallControlOffset

## Description
Sets the default wall control line offset value.

```pascal
PROCEDURE SetWallControlOffset(offset : REAL);
```

```python

def vs.SetWallControlOffset(offset):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|offset|REAL|New offset value.|

## Version
```diff
- SetWallControlOffset is obsolete as of VectorWorks12.5
```

Availability: from VectorWorks8.5
## Category
* Objects - Walls